{"id":397,"date":"2022-04-15T22:48:53","date_gmt":"2022-04-15T22:48:53","guid":{"rendered":"https:\/\/ocs.yorkd.sites.carleton.edu\/?p=397"},"modified":"2022-08-20T20:25:21","modified_gmt":"2022-08-20T20:25:21","slug":"a-warm-welcome-to-bahrain","status":"publish","type":"post","link":"https:\/\/ocs.yorkd.sites.carleton.edu\/all\/a-warm-welcome-to-bahrain\/","title":{"rendered":"5. A Warm Welcome to Bahrain"},"content":{"rendered":"\n<p>As we&#8217;ve been in Bahrain for almost two weeks now, I think it&#8217;d be nice to share how it&#8217;s going!<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>Going Northwest from Dubai, my group and I moved to the island-country known as Bahrain, supposedly home of the best natural pearls in the Gulf! Flying into the island was a tad surprising as the island began as a collection of about 30 small islands, but through the process of land reclamation over the last 100-150 years the smaller islands have become a larger interconnected collection. Bahrain also houses the HMS Juffair naval base which is a US naval base on the land of the former British Royal Naval Base(That&#8217;s all of the history about the US in Bahrain, I promise).<\/p>\n\n\n\n<div class=\"wp-block-image is-style-rounded\"><figure class=\"alignright is-resized\"><img src=\"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-content\/uploads\/2022\/04\/IMG_1169-scaled-e1649678576246.jpeg\" alt=\"Lamb Quzi\" class=\"wp-image-458\" width=\"400\" height=\"357\"\/><figcaption>Nuts, Raisins, Saffron Rice, and a whole slow-cooked lamb<\/figcaption><\/figure><\/div>\n\n\n\n<p>After arriving to Bahrain, my group was invited to dinner by Professor Sawsan Karimi, who has easily become my favorite person of the trip! Professor Karimi invited our whole group to her beautiful home which was prepared with beautiful decorations, the scent of buhoor(a frankincense incense), and her wonderful family. We were treated to an  introduction of materials she plans to teach us and to a true feast of delicious cultural foods, with my favorite being the traditional gosht quzi. When I tell you they put rice, nuts, raisins, a bunch of spices, and a WHOLE LAMB in the pot, you won&#8217;t believe me. Luckily here&#8217;s a picture for proof 😁<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>Of her lectures, so far we&#8217;ve touched on:<\/p>\n\n\n\n<ul><li>The celebration of Ramadan<\/li><li>Bahraini Tikka at her cousin&#8217;s local shop<\/li><li>The Pearling Path &amp; Heritage Houses of Muhharaq<\/li><li>The Heritage of Food<ul><li>More on all of these later <\/li><\/ul><\/li><\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>After dinner, Professor Karimi gathered us in her majlis, which is an essential room to Bahraini homes that is very open and spacious for gathering. In history, the majlis was a place where men would go to discuss business and have conversations of significance(it has since been opened up and is integrated in practice). I plan to have another great discussion about this important space in the future. During this discussion, we were given a very basic introduction into the culture of Bahrain and giving very small insights into all of the things we would be learning. <\/p>\n\n\n\n<p>Throughout the night, I recognized the emphasis on honoring your guest. As we sat in the majlis and spoke, Karimi&#8217;s husband, Ali, served all of the guest tea or karak(a common milk tea). Traditionally, the host serving will stand and present tea or coffee to guests until they are finished. The guest, out of modesty will raise their cup for up to 3 rounds of coffee, no more. After receiving your last cup, the guest is supposed to shake their cup signifying to the host that they are finished. Just one of the cultural respects practiced by a people with a long and strong history of building and keeping relations. <\/p>\n\n\n\n<p>As the night died down, Professor Karimi introduced us to another common practice.  Buhoor is an incense that is used to welcome guests, expel bad energies and it smells really good! The incense is made with frankincense is lit in an incense burner that allows one to move the scent around the home spreading the great smells.  When guests leave, they are sent off smelling of perfumes(all scents are universal, one must find their perfect scent). Guests are encouraged to receive buhoor onto their clothes and to put on a perfume of choice which is laid out near the exit. Seeing as this was only my first night in Bahrain, I&#8217;m sure you can only imagine what stories I have to tell next!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As we&#8217;ve been in Bahrain for almost two weeks now, I think it&#8217;d be nice to share how it&#8217;s going! Going Northwest from Dubai, my group and I moved to the island-country known as Bahrain, supposedly home of the best natural pearls in the Gulf! Flying into the island was a tad surprising as the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":456,"comment_status":"open","ping_status":"open","sticky":true,"template":"","format":"standard","meta":[],"categories":[1,18],"tags":[21],"_links":{"self":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/397"}],"collection":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/comments?post=397"}],"version-history":[{"count":17,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/397\/revisions"}],"predecessor-version":[{"id":526,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/397\/revisions\/526"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media\/456"}],"wp:attachment":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media?parent=397"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/categories?post=397"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/tags?post=397"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}