{"id":452,"date":"2022-04-08T11:32:10","date_gmt":"2022-04-08T11:32:10","guid":{"rendered":"https:\/\/ocs.yorkd.sites.carleton.edu\/?p=452"},"modified":"2022-08-20T20:25:17","modified_gmt":"2022-08-20T20:25:17","slug":"a-new-practice","status":"publish","type":"post","link":"https:\/\/ocs.yorkd.sites.carleton.edu\/all\/a-new-practice\/","title":{"rendered":"4. A New Practice"},"content":{"rendered":"\n<p>I wanted to take a post today to share my decision to observe and celebrate the holy month of Ramadan!<\/p>\n\n\n\n<hr class=\"wp-block-separator has-css-opacity\"\/>\n\n\n\n<p>This term will be my first time observing and celebrating Ramadan, which is one of 3 holy months found in the lunar calendar. During pre-departure meetings and every time I was reminded of Ramadan before the trip, I was sure that I would not participate in Ramadan as it was not inclusive of my journey of physical development through weightlifting, stretching, and physical activities, yet a lecture on the culture and meaning of Ramadan by Professor Karimi really changed my point of view on the subject, showing me the exact opposite of my preconceived notions.<\/p>\n\n\n\n<p>In her lecture, Professor Karimi took us through the meaning of Ramadan beyond the simple explanation given to me by Jesuit education’s theology classes. After all, this is her lifestyle and it is the holiday that she was raised observing and celebrating. She surprisingly opened the lecture questioning our understanding of the differences between spirituality and religious rituals. I struggled to answer this as I have recently considered myself a spiritual person who is not connected to a religion as I feel a lack of true representation of the values associated with religion. Surprisingly, Karimi’s favorite answer can describe spirituality as an individual journey through the abstract energies that are present in your life, making sense of who you are and gaining control over yourself. Religious rituals were described as visible, tangible collective activities that encourage and push the connection of a community who share these beliefs. This was one of the first introductions to Karimi and beginning from the dinner we experienced at her home, I noticed the strong appreciation\/respect\/value of family and community in both her life and the Bahraini culture as a whole.&nbsp;<\/p>\n\n\n\n<p>Speaking about the linguistic meaning of Ramadan is when I realized the purpose of the holiday that interested me the most. Ramdh, the root meaning of excessive heat, is telling of the holiday’s draining or exhausting of the body into submission as a means of controlling or training it for mental and spiritual gain. I found this rather inviting and in line with my own goals of conquering my body and in turn my mind in order to improve my focus, discernment and determination when doing tasks. I know that I personally have a problem israf(excessive consumption or production), aka gluttony, and want to reign in some of those things.<\/p>\n\n\n\n<p>&nbsp;When it comes to the experience I have had so far, I would describe it as successful. The dietary fasting has not seemed to be too difficult for me, even allowing me to complete full workouts at a local gym. I have even found it annoying when my roommate or other people ask how difficult it is to not eat or drink during the day because it isn’t something that I think about often and I have developed a go to move to solve spouts of hunger or thirst. My solution being deep nasal breathing. A full inhale through the nose and a slow, controlled release through the nose or mouth. I find that it calms the body and shifts my focus from hunger or thirst to whatever else there is for me to focus on in the present moment. It works well even when around peers who aren’t fasting and are eating or drinking, shifting my focus from what I am not doing(eating), to what I can be doing instead.<\/p>\n\n\n\n<p>As explained, the hard part of the fast comes not from dietary restriction, but from mental fortitude in the restriction. Another way that I have made the fasting simple is by sleeping and resting much more during the middle of the day. Spending more time lying in bed catching up with family, watching a show, or just sleeping. It works well, but I feel as if I could be spending more of that time focusing on studying or focusing on what I want out of this trip. All of this is to say that I don’t feel that I have this ‘excessive heat’ completely under my thumb, but the spiritual journey I am being taken on along with the support and company of my peers and the larger muslim community make me excited to continue!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I wanted to take a post today to share my decision to observe and celebrate the holy month of Ramadan! This term will be my first time observing and celebrating Ramadan, which is one of 3 holy months found in the lunar calendar. During pre-departure meetings and every time I was reminded of Ramadan before [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":345,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,18],"tags":[22],"_links":{"self":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/452"}],"collection":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/comments?post=452"}],"version-history":[{"count":3,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/452\/revisions"}],"predecessor-version":[{"id":525,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/452\/revisions\/525"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media\/345"}],"wp:attachment":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media?parent=452"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/categories?post=452"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/tags?post=452"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}