{"id":471,"date":"2022-04-22T12:17:18","date_gmt":"2022-04-22T12:17:18","guid":{"rendered":"https:\/\/ocs.yorkd.sites.carleton.edu\/?p=471"},"modified":"2022-08-20T20:25:46","modified_gmt":"2022-08-20T20:25:46","slug":"the-bba","status":"publish","type":"post","link":"https:\/\/ocs.yorkd.sites.carleton.edu\/all\/the-bba\/","title":{"rendered":"6. The BBA"},"content":{"rendered":"\n<p>Friends do I have a story for you😁<\/p>\n\n\n\n<p>Last Friday a couple of my group members and I went to the Bahraini Basketball Association&#8217;s playoffs! It was the first of their three game series between the old versus the new, the traditional versus the modern, the North versus the South; Muharraq vs. Manama. On this night, I witnessed what was truly an amazing performance of culture, giving a new meaning to my favorite sport.  <\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>There was a 10:30 pm tipoff with a 1 BD(~$3) admission fee through a local ticket-buying app. The small arena with no more than 1000 seats was split into sections of fans including the younger, rowdy crowd known as the ultras, and the family sections positioned across from each other for both teams. A low ceiling, small building and little space between the court and fans made the melting pot of sounds that much more intense and honestly, I imagine the dB count was higher than some other professional American leagues.<\/p>\n\n\n\n<p>The game itself was played with the same rules as in the US. The one thing I hated about them is the gather rule&#8230; Players could take two gather steps when catching the ball and it definitely made traveling just about useless, so much that a player was passed the ball on a fast break a few feet in front of half court and took 4 steps with no dribble before scoring a layup. Felt like I was watching an episode of <a rel=\"noreferrer noopener\" href=\"https:\/\/www.youtube.com\/watch?v=juvPwwOjFzs\" data-type=\"URL\" data-id=\"https:\/\/www.youtube.com\/watch?v=juvPwwOjFzs\" target=\"_blank\">Shaqtin&#8217; a Fool<\/a>!&nbsp;<\/p>\n\n\n\n<p>Jokes aside, what made this game different than just another basketball game was what the energy of the Bahraini crowd brought to the game. As it was a competition between Muharrraq and Manama, Bahrain’s old capital versus the new one, the rival energies were in full effect. There was a contrast of dress with the sea of traditional thobes worn by the Muharraq fanbase and the non-traditional mix of casual clothes worn by the Manama fans. The difference in bands was noticeable as well. A quick side note, I noticed a lack of music playing from speakers when we first walked into the stadium, but soon realized it was because the fans have full control in creating the music and atmosphere through the instruments they played and the chants led by those in the crowd. The culture of Bahrain radiated from the way the game was watched and there was so much energy felt there. Fans smiling and completely invested in the game, reaction and praise for every shot, every basket made, every foul call or dead ball. You could visibly sense the flow of momentum in the way that the fans were reacting. A back and forth from an isolation of Manama’s loud bass drums on a string buckets made on their end and a clap back from Muharraq on a turnover and fast break basket bringing them back into the game. This praise was not chaotic or unstructured by any means either. Being a part of the Muharraq family section, I picked up on the rythms they made during the game for each basket made, the reactions to blocks, chants during time outs, differences in free throws to throw off to opposing shooters or give good omen to the friendly shooters. As spectators, you had no choice but to embrace and join those great energies flowing.<\/p>\n\n\n\n<p>The beginning of the 4th quarter saw Muharraq down 10 points with 20 minutes to play. The game was up and down with them coming within 3 or four points and then losing energy or momentum and going back down. With around 4 minutes left in the game, Manama’s best two players who had been scoring at will were both fouled out. Everything was going well for Muharraq and with 1 minute left on the clock, down 4 with seconds left on the shot clock and nowhere to go with a defender in his face; number 5 looks to the basket, heaves up a three and sinks it to take the lead!! In the last minute I watched Manama trying to score and foul, ending in a 96 &#8211; 94 Muharraq W, taking a 1-0 lead in the series of 3!<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe title=\"Game 1 Muharraq v Manama Game Winner!\" width=\"1140\" height=\"641\" src=\"https:\/\/www.youtube.com\/embed\/mvnxIGwtEBI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>\n<\/div><figcaption>Final Lead Change of Game 1<\/figcaption><\/figure>\n\n\n\n<p>In the end, Manama ended up taking a 2-1 victory over Muharraq and were the finals champions of the 2022 BBA playoffs!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Friends do I have a story for you😁 Last Friday a couple of my group members and I went to the Bahraini Basketball Association&#8217;s playoffs! It was the first of their three game series between the old versus the new, the traditional versus the modern, the North versus the South; Muharraq vs. Manama. On this [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":472,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,18],"tags":[21],"_links":{"self":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/471"}],"collection":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/comments?post=471"}],"version-history":[{"count":5,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/471\/revisions"}],"predecessor-version":[{"id":527,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/471\/revisions\/527"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media\/472"}],"wp:attachment":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media?parent=471"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/categories?post=471"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/tags?post=471"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}