{"id":287,"date":"2022-03-22T04:30:31","date_gmt":"2022-03-22T04:30:31","guid":{"rendered":"https:\/\/ocs.yorkd.sites.carleton.edu\/?p=287"},"modified":"2022-03-22T17:48:12","modified_gmt":"2022-03-22T17:48:12","slug":"trip-overview","status":"publish","type":"post","link":"https:\/\/ocs.yorkd.sites.carleton.edu\/all\/trip-overview\/","title":{"rendered":"A Trip Overview"},"content":{"rendered":"\n<p>As I will be leaving soon, I guess it&#8217;d be a good idea to share a little about my trip here on the blog.<\/p>\n\n\n\n<h2>The Adventure<\/h2>\n\n\n\n<p>During this experience, I will be studying the History and Commerce between Africa and Arabia in the United Arab Emirates and Bahrain in order to gain a perspective on the world that is unlike any culture that I have experienced or studied so far.<\/p>\n\n\n\n<p>This Off-Campus Study is a Carleton led program titled History and Commerce: Africa and Arabia. It will be led by one of my favorite professors, Professor Thabiti Willis, who is the Director of Africana Studies in his 12th year at Carleton. While abroad, Professor Willis has 3 courses planned including: African Diaspora in Arabia, Heritage in Africa and Arabia, and a Critical Historical Research course. These class sessions will be supplemented with trips to many museums, cultural sights and more.<\/p>\n\n\n\n<p>The program is from March 24, through June 1st and I will spend the first week in Dubai, UAE, where I will get to experience the great city while learning from scholars at the Africa Institute of Sharjah, UAE. The institute is an interdisciplinary academic research institute dedicated to the study, research and documentation of Africa, its people and its cultures. The institute will provide me with0 the chance to meet with and learn from many scholars like Dr. Ibrahim Nor Shariff, an intellectual and artist who has published several books, specializes in Swahili Poetry and is of Omani Zanzibar descent!<\/p>\n\n\n\n<h2>The Blog<\/h2>\n\n\n\n<p>Aside from having an amazing time in a part of the world I would never have access to otherwise, I am hoping to document my experience abroad through this blog post. I’m hoping to have the blog host a gallery of sceneries, people, food, and places I visit. The greatest gift yielded from a blog is being able to share fundamental pieces of my time abroad. I understand a trip to the middle east as something most people are not fortunate enough to experience, let alone study African history there! Being able to document and share my experience will be a way to bring along family, friends, and you who has interest in my travels. <\/p>\n\n\n\n<p>Thank you again to all that have decided to follow my experience and a greater thanks to those who have contributed to my travels.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As I will be leaving soon, I guess it&#8217;d be a good idea to share a little about my trip here on the blog. The Adventure During this experience, I will be studying the History and Commerce between Africa and Arabia in the United Arab Emirates and Bahrain in order to gain a perspective on [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":291,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/287"}],"collection":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/comments?post=287"}],"version-history":[{"count":3,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/287\/revisions"}],"predecessor-version":[{"id":292,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/287\/revisions\/292"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media\/291"}],"wp:attachment":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media?parent=287"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/categories?post=287"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/tags?post=287"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}