{"id":486,"date":"2022-08-17T14:33:22","date_gmt":"2022-08-17T14:33:22","guid":{"rendered":"https:\/\/ocs.yorkd.sites.carleton.edu\/?p=486"},"modified":"2022-08-17T15:45:50","modified_gmt":"2022-08-17T15:45:50","slug":"a-completed-story","status":"publish","type":"post","link":"https:\/\/ocs.yorkd.sites.carleton.edu\/all\/a-completed-story\/","title":{"rendered":"A Completed Story"},"content":{"rendered":"\n<p>Contrary to popular belief, I am still alive and the blog is finally coming to fruition, though not in terms of blog posts. As the program continued to develop I found myself unable to post blogs consistently while also soaking up all of the experience that I was having. I chose instead to dive into personal journaling and to focus on capturing the experience through as many pictures as I could while enjoying my time instead of breaking my back trying to upload the developed blog posts that I began with.  <\/p>\n\n\n\n<p>As a send-off and completion of this experience I&#8217;d like to give a reflection on the blessing that I received as well as leave a link here for viewing all of my favorite images.<\/p>\n\n\n\n<p>I&#8217;d like to start by acknowledging two angels that fell on my path. Both in the form of interlocutors between the GCC and me, these being gifted me with so much knowledge, and love that has continued to produce questions, and dialogue about how I see myself, this world, those around me and so much more.  Shown to me through embodied knowledge of self; I learned life-long lessons on self-principles, the importance of relationships and relationship building, and the importance and meaning of family. These angels were named Dr. Thabiti Willis and Dr. Sawsan Karimi.  As they both intentionally and unintentionally educated me on myself, the US, the diasporic African of the East and the West, and the GCC countries, I am forever grateful for the long nights of group conversations in the Gulf Hotel lobby, or reflections on the knowledge acquired in a day much too dense for the short bus ride back to the hotel. <\/p>\n\n\n\n<p>I have spent hours reflecting and appreciating the lessons they have brought to my attention. A favorite of mine being appreciating the beauty of having a family to call upon.  Knowing that it takes a village to raise a child, from my own experience hit m  Professor Willis has spent many influential hours opening up my mindset to take my focus deeper than what is presented to me, but to focus my energy on what is not said, what is shy&#8217;d away from, and what is off limits. e in such a different light after seeing the way that the Bahraini and Omani cultures live this ideology out. There is only so much that one can take from a lecture, text, or a museum exhibit and this shifted frame of focus has opened doors and revealed knowledge that 5 pages of text on this blog wouldn&#8217;t come close to covering.  <\/p>\n\n\n\n<p>I would like to touch on the blessing of this once-in-a-lifetime opportunity to study in a space where the only Americans in sight are a part of the US Navy; where the customs are so infused with the beauty of Islam and the Arab culture while still making space for those our US ways; where the ideal of race is lacking and ethnicity and familial name begin to take precedent. The experience has reminded me that I walk my path each and every day with an appreciation for the beautiful earth that my feet are graced to walk upon.<br><\/p>\n\n\n\n<p>Here is a <a rel=\"noreferrer noopener\" href=\"https:\/\/drive.google.com\/drive\/folders\/19wh5r9qNpt1ErzUaBziG3VLdW5iv0pe-?usp=sharing\" data-type=\"URL\" data-id=\"https:\/\/drive.google.com\/drive\/folders\/19wh5r9qNpt1ErzUaBziG3VLdW5iv0pe-?usp=sharing\" target=\"_blank\">link<\/a> for the images from Arabia that I would like to share!! I was hoping to have a more visually pleasing image gallery, but Google Drive has been the simplest and most cost-effective solution. <\/p>\n\n\n\n<p>And here&#8217;s to a final thank you for following me along this journey! I hope you enjoy my images and please feel free to reach out to me for questions @<a rel=\"noreferrer noopener\" href=\"mailto:yorkd@carleton.edu\" target=\"_blank\">yorkd@carleton.edu<\/a>.<\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Contrary to popular belief, I am still alive and the blog is finally coming to fruition, though not in terms of blog posts. As the program continued to develop I found myself unable to post blogs consistently while also soaking up all of the experience that I was having. I chose instead to dive into [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":501,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/486"}],"collection":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/comments?post=486"}],"version-history":[{"count":10,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/486\/revisions"}],"predecessor-version":[{"id":500,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/posts\/486\/revisions\/500"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media\/501"}],"wp:attachment":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media?parent=486"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/categories?post=486"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/tags?post=486"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}