{"id":250,"date":"2022-02-28T17:41:47","date_gmt":"2022-02-28T17:41:47","guid":{"rendered":"https:\/\/ocs.yorkd.sites.carleton.edu\/?page_id=250"},"modified":"2022-08-20T19:48:16","modified_gmt":"2022-08-20T19:48:16","slug":"about-the-ocs","status":"publish","type":"page","link":"https:\/\/ocs.yorkd.sites.carleton.edu\/about-the-ocs\/","title":{"rendered":"About the OCS"},"content":{"rendered":"\n<p><\/p>\n\n\n\n<h2>The Trip<\/h2>\n\n\n\n<p>During the spring, I will be studying the History and Commerce between Africa and Arabia in the United Arab Emirates and Bahrain in order to gain a perspective on the world that is unlike any culture that I have experienced or studied so far.<\/p>\n\n\n\n<p>This Off Campus Study is a Carleton led program titled History and Commerce: Africa and Arabia. It will be led by one of my favorite professors, Professor Thabiti Willis, who is the Director of Africana Studies in his 12th year at Carleton. While abroad, Professor Willis has 3 courses planned including: African Diaspora in Arabia, Heritage in Africa and Arabia, and a Critical Historical Research course. These class sessions will be supplemented with trips to many museums, cultural sights and more.<\/p>\n\n\n\n<p>The program is from March 24, through June 1st and I will spend the first week in Dubai, UAE, where I will get to experience the great city while learning from scholars at the Africa Institute of Sharjah, UAE. The institute is an interdisciplinary academic research institute dedicated to the study, research and documentation of Africa, its people and its cultures. The institute will provide me with0 the chance to meet with and learn from many scholars like Dr. Ibrahim Nor Shariff, an intellectual and artist who has published several books, specializes in Swahili Poetry and is of Omani Zanzibar descent!<\/p>\n\n\n\n<p>After spending time in Dubai, my group will travel northwest to Bahrain where I will be spending the rest of my time being immersed in the beautiful Bahraini culture. I will get the chance to interact with Bahraini locals and professors who will educate me on cultural dress and identities found within the community; the melting pot of delicious cultural foods grabbing inspiration from Persia, India, Iraq and Oman; the customs of perfumery and incense; and the topic I am most interested in, music and its performance.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Trip During the spring, I will be studying the History and Commerce between Africa and Arabia in the United Arab Emirates and Bahrain in order to gain a perspective on the world that is unlike any culture that I have experienced or studied so far. This Off Campus Study is a Carleton led program [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/pages\/250"}],"collection":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/comments?post=250"}],"version-history":[{"count":2,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/pages\/250\/revisions"}],"predecessor-version":[{"id":259,"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/pages\/250\/revisions\/259"}],"wp:attachment":[{"href":"https:\/\/ocs.yorkd.sites.carleton.edu\/wp-json\/wp\/v2\/media?parent=250"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}